# Basic commands

These are the basic key value commands.

### `PING`

Check if the server is alive.

#### Example

```sh
> PING
PONG
```

### `GET <key>`

Get the value of a key.

#### Example

```sh
# Exists
> GET foo
bar

# Doesn't exist
> GET bar
```

### `SET <key> <value>`

Set the value of a key.

#### Example

```sh
> SET foo bar
bar

> SET another 123
123

> SET user:1:name John Doe
John Doe
```

### `DEL <key>`

Delete a key.

#### Example

```sh
> DEL foo
foo
```
